loadtests/wrk/accountings/c10
Running 30s test @ http://localhost/search-user?search?mar%20kar
  8 threads and 10 connections
  Thread calibration: mean lat.: 5009.808ms, rate sampling interval: 16793ms
  Thread calibration: mean lat.: 4869.128ms, rate sampling interval: 16359ms
  Thread calibration: mean lat.: 4967.120ms, rate sampling interval: 16662ms
  Thread calibration: mean lat.: 4866.728ms, rate sampling interval: 16285ms
  Thread calibration: mean lat.: 4859.768ms, rate sampling interval: 16302ms
  Thread calibration: mean lat.: 4818.858ms, rate sampling interval: 17268ms
  Thread calibration: mean lat.: 5053.424ms, rate sampling interval: 16875ms
  Thread calibration: mean lat.: 5023.352ms, rate sampling interval: 16809ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.77s     5.76s   29.75s    57.81%
    Req/Sec     1.00      0.00     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.73s 
 75.000%   24.72s 
 90.000%   27.74s 
 99.000%   29.59s 
 99.900%   29.77s 
 99.990%   29.77s 
 99.999%   29.77s 
100.000%   29.77s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000            1         1.00
   11640.831     0.100000           24         1.11
   13746.175     0.200000           48         1.25
   15728.639     0.300000           72         1.43
   17694.719     0.400000           95         1.67
   19726.335     0.500000          119         2.00
   20824.063     0.550000          131         2.22
   21807.103     0.600000          144         2.50
   22773.759     0.650000          155         2.86
   23740.415     0.700000          166         3.33
   24723.455     0.750000          178         4.00
   25198.591     0.775000          184         4.44
   25788.415     0.800000          190         5.00
   26279.935     0.825000          196         5.71
   26771.455     0.850000          202         6.67
   27262.975     0.875000          208         8.00
   27508.735     0.887500          211         8.89
   27852.799     0.900000          214        10.00
   28098.559     0.912500          217        11.43
   28295.167     0.925000          220        13.33
   28573.695     0.937500          223        16.00
   28639.231     0.943750          224        17.78
   28803.071     0.950000          226        20.00
   28884.991     0.956250          227        22.86
   29097.983     0.962500          229        26.67
   29245.439     0.968750          231        32.00
   29245.439     0.971875          231        35.56
   29343.743     0.975000          232        40.00
   29343.743     0.978125          232        45.71
   29458.431     0.981250          233        53.33
   29491.199     0.984375          234        64.00
   29491.199     0.985938          234        71.11
   29589.503     0.987500          235        80.00
   29589.503     0.989062          235        91.43
   29589.503     0.990625          235       106.67
   29671.423     0.992188          236       128.00
   29671.423     0.992969          236       142.22
   29671.423     0.993750          236       160.00
   29671.423     0.994531          236       182.86
   29671.423     0.995313          236       213.33
   29769.727     0.996094          237       256.00
   29769.727     1.000000          237          inf
#[Mean    =    19766.155, StdDeviation   =     5761.327]
#[Max     =    29753.344, Total count    =          237]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  364 requests in 30.01s, 533.56KB read
Requests/sec:     12.13
Transfer/sec:     17.78KB