loadtests/wrk/accountings/c100
Running 30s test @ http://localhost/search-user?search?mar%20kar
  8 threads and 100 connections
  Thread calibration: mean lat.: 8126.293ms, rate sampling interval: 16760ms
  Thread calibration: mean lat.: 8271.530ms, rate sampling interval: 17104ms
  Thread calibration: mean lat.: 8302.592ms, rate sampling interval: 17235ms
  Thread calibration: mean lat.: 8463.360ms, rate sampling interval: 17285ms
  Thread calibration: mean lat.: 8264.704ms, rate sampling interval: 17104ms
  Thread calibration: mean lat.: 8295.424ms, rate sampling interval: 17022ms
  Thread calibration: mean lat.: 8301.909ms, rate sampling interval: 17137ms
  Thread calibration: mean lat.: 8340.138ms, rate sampling interval: 17121ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.68s     4.27s   26.49s    50.00%
    Req/Sec     1.00      0.00     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.15s 
 75.000%   25.00s 
 90.000%   25.62s 
 99.000%   26.36s 
 99.900%   26.51s 
 99.990%   26.51s 
 99.999%   26.51s 
100.000%   26.51s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   15458.303     0.000000            1         1.00
   16031.743     0.100000           20         1.11
   16375.807     0.200000           39         1.25
   16687.103     0.300000           58         1.43
   16908.287     0.400000           80         1.67
   17154.047     0.500000           96         2.00
   23740.415     0.550000          106         2.22
   23953.407     0.600000          117         2.50
   24281.087     0.650000          125         2.86
   24723.455     0.700000          135         3.33
   25001.983     0.750000          144         4.00
   25133.055     0.775000          149         4.44
   25247.743     0.800000          155         5.00
   25378.815     0.825000          161         5.71
   25444.351     0.850000          164         6.67
   25493.503     0.875000          168         8.00
   25575.423     0.887500          171         8.89
   25624.575     0.900000          173        10.00
   25657.343     0.912500          176        11.43
   25722.879     0.925000          178        13.33
   25821.183     0.937500          180        16.00
   25870.335     0.943750          182        17.78
   25886.719     0.950000          183        20.00
   25935.871     0.956250          184        22.86
   26132.479     0.962500          185        26.67
   26214.399     0.968750          186        32.00
   26263.551     0.971875          187        35.56
   26296.319     0.975000          188        40.00
   26296.319     0.978125          188        45.71
   26361.855     0.981250          190        53.33
   26361.855     0.984375          190        64.00
   26361.855     0.985938          190        71.11
   26361.855     0.987500          190        80.00
   26361.855     0.989062          190        91.43
   26427.391     0.990625          191       106.67
   26427.391     0.992188          191       128.00
   26427.391     0.992969          191       142.22
   26427.391     0.993750          191       160.00
   26427.391     0.994531          191       182.86
   26509.311     0.995313          192       213.33
   26509.311     1.000000          192          inf
#[Mean    =    20684.971, StdDeviation   =     4266.109]
#[Max     =    26492.928, Total count    =          192]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  288 requests in 30.08s, 422.16KB read
  Socket errors: connect 0, read 0, write 0, timeout 1152
Requests/sec:      9.57
Transfer/sec:     14.03KB