loadtests/wrk/accountings/c1000
Running 30s test @ http://localhost/search-user?search?mar%20kar
  8 threads and 1000 connections
  Thread calibration: mean lat.: 18.846ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 61.096ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 66.726ms, rate sampling interval: 262ms
  Thread calibration: mean lat.: 76.940ms, rate sampling interval: 142ms
  Thread calibration: mean lat.: 59.191ms, rate sampling interval: 121ms
  Thread calibration: mean lat.: 28.004ms, rate sampling interval: 126ms
  Thread calibration: mean lat.: 8.739ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    78.69ms  251.89ms   1.60s    92.33%
    Req/Sec    74.19    307.94     3.63k    95.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.78ms
 75.000%   15.79ms
 90.000%   36.35ms
 99.000%    1.08s 
 99.900%    1.57s 
 99.990%    1.60s 
 99.999%    1.60s 
100.000%    1.60s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.147     0.000000            1         1.00
       2.439     0.100000         2463         1.11
       4.359     0.200000         4926         1.25
       5.723     0.300000         7383         1.43
       7.147     0.400000         9845         1.67
       8.783     0.500000        12302         2.00
      10.407     0.550000        13541         2.22
      11.503     0.600000        14763         2.50
      12.543     0.650000        15996         2.86
      14.495     0.700000        17227         3.33
      15.791     0.750000        18457         4.00
      16.719     0.775000        19071         4.44
      18.527     0.800000        19686         5.00
      19.887     0.825000        20299         5.71
      22.959     0.850000        20913         6.67
      26.623     0.875000        21528         8.00
      31.119     0.887500        21836         8.89
      36.351     0.900000        22143        10.00
      53.151     0.912500        22451        11.43
     516.607     0.925000        22759        13.33
     538.623     0.937500        23072        16.00
     553.471     0.943750        23225        17.78
     574.463     0.950000        23384        20.00
    1013.247     0.956250        23531        22.86
    1021.951     0.962500        23682        26.67
    1030.655     0.968750        23837        32.00
    1033.727     0.971875        23912        35.56
    1035.775     0.975000        23997        40.00
    1039.871     0.978125        24065        45.71
    1049.599     0.981250        24151        53.33
    1052.671     0.984375        24224        64.00
    1057.791     0.985938        24260        71.11
    1068.031     0.987500        24299        80.00
    1074.175     0.989062        24341        91.43
    1077.247     0.990625        24374       106.67
    1099.775     0.992188        24411       128.00
    1537.023     0.992969        24431       142.22
    1544.191     0.993750        24455       160.00
    1548.287     0.994531        24470       182.86
    1550.335     0.995313        24491       213.33
    1553.407     0.996094        24508       256.00
    1555.455     0.996484        24519       284.44
    1560.575     0.996875        24529       320.00
    1565.695     0.997266        24538       365.71
    1569.791     0.997656        24555       426.67
    1569.791     0.998047        24555       512.00
    1570.815     0.998242        24562       568.89
    1572.863     0.998437        24569       640.00
    1573.887     0.998633        24577       731.43
    1573.887     0.998828        24577       853.33
    1574.911     0.999023        24582      1024.00
    1574.911     0.999121        24582      1137.78
    1595.391     0.999219        24587      1280.00
    1595.391     0.999316        24587      1462.86
    1596.415     0.999414        24594      1706.67
    1596.415     0.999512        24594      2048.00
    1596.415     0.999561        24594      2275.56
    1596.415     0.999609        24594      2560.00
    1597.439     0.999658        24599      2925.71
    1597.439     0.999707        24599      3413.33
    1597.439     0.999756        24599      4096.00
    1597.439     0.999780        24599      4551.11
    1597.439     0.999805        24599      5120.00
    1597.439     0.999829        24599      5851.43
    1598.463     0.999854        24603      6826.67
    1598.463     1.000000        24603          inf
#[Mean    =       78.689, StdDeviation   =      251.889]
#[Max     =     1597.440, Total count    =        24603]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  36755 requests in 30.66s, 11.64MB read
  Socket errors: connect 0, read 19, write 0, timeout 5000
  Non-2xx or 3xx responses: 36755
Requests/sec:   1198.96
Transfer/sec:    388.69KB